1.select "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_СЕССИЯ"."УЧГОД" from "Н_ЛЮДИ" left
join "Н_СЕССИЯ" on "Н_ЛЮДИ".ИД ="Н_СЕССИЯ"."ЧЛВК_ИД" where
"Н_ЛЮДИ"."ОТЧЕСТВО" < 'Сергеевич' and "Н_СЕССИЯ"."УЧГОД" > '2001/2002'
and "Н_СЕССИЯ"."УЧГОД" = '2011/2012'

2.select "Н_ЛЮДИ".ИД , "Н_ОБУЧЕНИЯ".НЗК , "Н_УЧЕНИКИ".ИД from "Н_ЛЮДИ"
left join "Н_УЧЕНИКИ" on "Н_ЛЮДИ"."ИД"="Н_УЧЕНИКИ"."ЧЛВК_ИД" left join
"Н_ОБУЧЕНИЯ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" where
"Н_ЛЮДИ"."ИМЯ" = 'Ярослав' and "Н_ОБУЧЕНИЯ"."НЗК" > '999080'

3. SELECT COUNT(*)
FROM Н_УЧЕНИКИ
RIGHT JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ' AND Н_ЛЮДИ.ОТЧЕСТВО = '.'
4.
select distinct "Н_ЛЮДИ"."ОТЧЕСТВО", count(*) from "Н_ЛЮДИ" join
"Н_УЧЕНИКИ" on "Н_ЛЮДИ".ИД = "Н_УЧЕНИКИ"."ЧЛВК_ИД" join
"Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_УЧЕНИКИ"."ВИД_ОБУЧ_ИД" =
"Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
group by "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
having 50 > (select count(*) from "Н_ЛЮДИ" where "ОТЧЕСТВО" =
"ОТЧЕСТВО") and "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = 3

5. SELECT ОЦЕНОЧКИ.ИД, ОЦЕНОЧКИ.ГРУППА, ОЦЕНОЧКИ.ИМЯ, ОЦЕНОЧКИ.ФАМИЛИЯ,
ОЦЕНОЧКИ.ОТЧЕСТВО, AVG(ОЦЕНОЧКИ.ОЦЕН) AS "СР_ОЦЕНКА" FROM (
SELECT Н_ЛЮДИ.ИД, Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ,
Н_ЛЮДИ.ОТЧЕСТВО, CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER) AS ОЦЕН FROM Н_ВЕДОМОСТИ
JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД AND
Н_УЧЕНИКИ.ГРУППА = '4100'
JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ВЕДОМОСТИ.ОЦЕНКА IN ('2', '3', '4', '5')
) AS ОЦЕНОЧКИ
GROUP BY
ОЦЕНОЧКИ.ИД,
ОЦЕНОЧКИ.ГРУППА,
ОЦЕНОЧКИ.ИМЯ,
ОЦЕНОЧКИ.ФАМИЛИЯ,
ОЦЕНОЧКИ.ОТЧЕСТВО

HAVING AVG(ОЦЕНОЧКИ.ОЦЕН) <= (SELECT MIN(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS
INTEGER)) FROM Н_ВЕДОМОСТИ
JOIN
Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД AND Н_УЧЕНИКИ.ГРУППА =
'3100'
WHERE Н_ВЕДОМОСТИ.ОЦЕНКА IN ('2', '3', '4', '5'));

6. SELECT
"УЧЕНИКИ1"."ГРУППА",
"УЧЕНИКИ1"."ИД",
"Н_ЛЮДИ"."ФАМИЛИЯ",
"Н_ЛЮДИ"."ИМЯ",
"Н_ЛЮДИ"."ОТЧЕСТВО",
"УЧЕНИКИ1"."П_ПРКОК_ИД",
"УЧЕНИКИ1"."СОСТОЯНИЕ"
FROM
"Н_УЧЕНИКИ" "УЧЕНИКИ1"
JOIN "Н_ЛЮДИ" ON "УЧЕНИКИ1"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE
EXISTS(
SELECT
*
FROM
"Н_УЧЕНИКИ" "УЧЕНИКИ2"
JOIN "Н_ПЛАНЫ" ON "УЧЕНИКИ2"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
AND "Н_ПЛАНЫ"."КУРС" = 1
JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" =
"Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
WHERE
DATE("УЧЕНИКИ2"."НАЧАЛО") < '2012-09-01'
);
7.select DISTINCT Копия."ФАМИЛИЯ" from "Н_ЛЮДИ", "Н_ЛЮДИ" Копия join
"Н_УЧЕНИКИ" on Копия."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД" where
"Н_ЛЮДИ"."ФАМИЛИЯ" = Копия."ФАМИЛИЯ" and "Н_ЛЮДИ"."ИД" != Копия."ИД"